#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	#Область БлокировкаДанных
	// Для прихода достаточно разделяемой блокировки по товарам документа.
	БлокировкаДанных = Новый БлокировкаДанных;
	ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрНакопления.ОстаткиТоваров");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Разделяемый;
	ЭлементБлокировки.ИсточникДанных = Товары;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Товар", "Товар");
	ЭлементБлокировки.УстановитьЗначение("Период", Новый Диапазон(, Дата));
	БлокировкаДанных.Заблокировать();
	#КонецОбласти

	#Область СозданиеНаборовЗаписей
	Движения.ОстаткиТоваров.Записывать = Истина;
	Движения.ОстаткиТоваров.Очистить();
	#КонецОбласти

	#Область ЗаписьДвижений
	Для Каждого СтрокаТоваров Из Товары Цикл
		ДвижениеОстатковТоваров = Движения.ОстаткиТоваров.Добавить();
		ДвижениеОстатковТоваров.ВидДвижения = ВидДвиженияНакопления.Приход;
		ДвижениеОстатковТоваров.Период = Дата;
		ДвижениеОстатковТоваров.Товар = СтрокаТоваров.Товар;
		ДвижениеОстатковТоваров.Количество = СтрокаТоваров.Количество;
	КонецЦикла;
	#КонецОбласти

КонецПроцедуры

#КонецОбласти