#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти

#Область ОбработкаПроведения

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	#Область СозданиеНаборовЗаписей
	Движения.ОстаткиТоваров.Записывать = Истина;
	Движения.ОстаткиТоваров.Очистить();
	#КонецОбласти

	#Область ЗаписьДвижений
	Для Каждого СтрокаТоваров Из Товары Цикл
		ДвижениеОстатковТоваров = Движения.ОстаткиТоваров.Добавить();
		ДвижениеОстатковТоваров.ВидДвижения = ВидДвиженияНакопления.Приход;
		ДвижениеОстатковТоваров.Период = Дата;
		ДвижениеОстатковТоваров.Товар = СтрокаТоваров.Товар;
		ДвижениеОстатковТоваров.Количество = СтрокаТоваров.Количество;
	КонецЦикла;
	#КонецОбласти

КонецПроцедуры

#КонецОбласти