#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	#Область ПроверкаЗаполненияТабличнойЧасти
	Если Товары.Количество() = 0 Тогда
		Отказ = Истина;
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = "Поле ""Товары"" не заполнено! Проведение невозможно.";
		СообщениеПользователю.Поле = "Товары";
		СообщениеПользователю.УстановитьДанные(ЭтотОбъект);
		СообщениеПользователю.Сообщить();
		Возврат;
	КонецЕсли;
	#КонецОбласти

	#Область БлокировкаДанных
	БлокировкаДанных = Новый БлокировкаДанных;
	ЭлементБлокировки = БлокировкаДанных.Добавить("РегистрНакопления.ОстаткиТоваров");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = Товары;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Товар", "Товар");
	БлокировкаДанных.Заблокировать();
	#КонецОбласти

	#Область СозданиеНаборовЗаписей
	Движения.ОстаткиТоваров.Записывать = Истина;
	Движения.ОстаткиТоваров.Очистить();
	#КонецОбласти

	#Область ЗаписьДвижений
	Для Каждого СтрокаТоваров Из Товары Цикл
		ДвижениеОстатковТоваров = Движения.ОстаткиТоваров.Добавить();
		ДвижениеОстатковТоваров.ВидДвижения = ВидДвиженияНакопления.Приход;
		ДвижениеОстатковТоваров.Период = Дата;
		ДвижениеОстатковТоваров.Товар = СтрокаТоваров.Товар;
		ДвижениеОстатковТоваров.Количество = СтрокаТоваров.Количество;
	КонецЦикла;
	#КонецОбласти

КонецПроцедуры

#КонецОбласти