#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти

#Область ОбработкаПроведения

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	#Область ПроверкаЗаполненияТабличнойЧасти
	Если Товары.Количество() = 0 Тогда
		Отказ = Истина;
		СообщениеПользователю = Новый СообщениеПользователю;
		СообщениеПользователю.Текст = "Табличная часть ""Товары"" не заполнена! Проведение невозможно.";
		СообщениеПользователю.Поле = "Товары";
		СообщениеПользователю.УстановитьДанные(ЭтотОбъект);
		СообщениеПользователю.Сообщить();
		Возврат;
	КонецЕсли;
	#КонецОбласти
	
	#Область СозданиеНаборовЗаписей
	Движения.ОстаткиТоваров.Записывать = Истина;
	Движения.ОстаткиТоваров.Очистить();
	#КонецОбласти

	#Область ЗаписьДвижений
	Для Каждого СтрокаТоваров Из Товары Цикл
		ДвижениеОстатковТоваров = Движения.ОстаткиТоваров.Добавить();
		ДвижениеОстатковТоваров.ВидДвижения = ВидДвиженияНакопления.Приход;
		ДвижениеОстатковТоваров.Период = Дата;
		ДвижениеОстатковТоваров.Товар = СтрокаТоваров.Товар;
		ДвижениеОстатковТоваров.Количество = СтрокаТоваров.Количество;
	КонецЦикла;
	#КонецОбласти

КонецПроцедуры

#КонецОбласти