#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти

#Область ОбработкаПроведения

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	#Область БлокировкаДанных
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.ОстаткиТоваров");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = Товары;
	ЭлементБлокировки.ИспользоватьИзИсточникаДанных("Товар", "Товар");
	Блокировка.Заблокировать();
	#КонецОбласти
	
	#Область СозданиеНаборовЗаписей
	Движения.ОстаткиТоваров.Записывать = Истина;
	Движения.ОстаткиТоваров.Очистить();
	#КонецОбласти

	#Область ЗапросОстатков
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РеализацияТовары.Товар КАК Товар,
	|	СУММА(РеализацияТовары.Количество) КАК Количество
	|ПОМЕСТИТЬ ВТ_Товары
	|ИЗ
	|	Документ.Реализация.Товары КАК РеализацияТовары
	|ГДЕ
	|	РеализацияТовары.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	РеализацияТовары.Товар
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Товары.Товар КАК Товар,
	|	ЕСТЬNULL(ВТ_Товары.Количество, 0) КАК КоличествоВДокументе,
	|	ЕСТЬNULL(ОстаткиТоваровОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
	|	ВТ_Товары.Товар.Представление КАК ТоварПредставление
	|ИЗ
	|	ВТ_Товары КАК ВТ_Товары
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТоваров.Остатки(
	|				&МоментВремени,
	|				Товар В
	|					(ВЫБРАТЬ
	|						ВТ_Товары.Товар
	|					ИЗ
	|						ВТ_Товары КАК ВТ_Товары)) КАК ОстаткиТоваровОстатки
	|		ПО ВТ_Товары.Товар = ОстаткиТоваровОстатки.Товар";

	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(МоментВремени(), ВидГраницы.Включая));
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();

	Пока Выборка.Следующий() Цикл
		Превышение = Выборка.КоличествоВДокументе - Выборка.КоличествоОстаток;
		Если Превышение > 0 Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("Не хватает товара ""%1"". Требуется: %2, остаток на складе: %3", Выборка.ТоварПредставление, Выборка.КоличествоВДокументе, Выборка.КоличествоОстаток);
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	#КонецОбласти

	#Область ЗаписьДвижений
	Для Каждого СтрокаТоваров Из Товары Цикл
		ДвижениеОстатковТоваров = Движения.ОстаткиТоваров.Добавить();
		ДвижениеОстатковТоваров.ВидДвижения = ВидДвиженияНакопления.Расход;
		ДвижениеОстатковТоваров.Период = Дата;
		ДвижениеОстатковТоваров.Товар = СтрокаТоваров.Товар;
		ДвижениеОстатковТоваров.Количество = СтрокаТоваров.Количество;
	КонецЦикла;
	#КонецОбласти

КонецПроцедуры

#КонецОбласти