#Область ОбработчикиСобытий

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	СформироватьПечатнуюФорму(ТабличныйДокумент, ПараметрКоманды);

	ТабличныйДокумент.ОтображатьСетку = Ложь;
	ТабличныйДокумент.Защита = Ложь;
	ТабличныйДокумент.ТолькоПросмотр = Ложь;
	ТабличныйДокумент.ОтображатьЗаголовки = Ложь;
	ТабличныйДокумент.Показать();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Вызывает формирование печатной формы в модуле менеджера документа.
//
&НаСервере
Процедура СформироватьПечатнуюФорму(ТабличныйДокумент, ДокументыОснования)
	Документы.Реализация.СформироватьПечатнуюФорму(ТабличныйДокумент, ДокументыОснования);
КонецПроцедуры

#КонецОбласти
